[
    {
        "id": 1,
        "img": "/images/tvtrack.png",
        "imgmobile": "/images/tvtrackmobile.png",
        "title": "TV Track",
        "subtitle": "Aplicación de películas y series",
        "url": "https://tv-track-24.web.app",
        "description": "Aplicación donde los usuarios podrán ingresar con su cuenta y llevar un registro de las películas y series que hayan visto o las que quieran ver a continuación. Desarrollado Con React JS para el front, la API de TMDB para todos los datos de las películas y series, y Firestore para la autenticación de usuarios y las listas."
    },
    {
        "id": 2,
        "img": "/images/bz.png",
        "imgmobile": "/images/bzmobile.png",
        "title": "BasketZone",
        "subtitle": "E-commerce de camisetas de basquet",
        "url": "https://basket-zone.vercel.app",
        "description": "E-commerce de camisetas de básquet desarrollado con React JS para el front y Firebase para el back. El sitio cuenta con autenticación de usuarios, carrito de compras, lista de favoritos, y división de camisetas por categorías. Usé Firestore Database para manejar toda la lógica del listado y filtrado de productos y Storage para almacenar las imágenes de cada producto"
    },
    {
        "id": 3,
        "img": "/images/ktw.png",
        "imgmobile": "/images/ktw-mobile.png",
        "title": "Know the world",
        "subtitle": "Aplicación de geografía",
        "url": "https://know-the-world-three.vercel.app/",
        "description": "Aplicación de geografía que consta de tres partes: Un mapa interactivo donde se puede hacer click en un país y ver información del mismo, una lista de tarjetas de cada país con información básica, y un quiz de preguntas y respuestas. Está desarrollada con React JS y usa apis y librerias para el mapa y la información."
    },
    {
        "id": 4,
        "img": "/images/chatapp.png",
        "title": "Chat App",
        "imgmobile": "/images/chatappmobile.png",
        "subtitle": "Aplicación de chat a tiempo real",
        "url": "https://alberchatapp.vercel.app",
        "description": "Chat a tiempo real desarrollado con React JS para el front y Firebase para el back. La prioridad en este proyecto fue la interactividad entre usuarios. Utilicé los servicios Auth y Firestore database de Firebase para la autenticación de usuarios y el almacenamiento y lógica de los mensajes. Los usuarios pueden registrarse o loguearse para interactuar con otros usuarios, enviar, editar y borrar mensajes."
    },
    {
        "id": 5,
        "img": "/images/coinview.png",
        "imgmobile": "/images/coinviewmobile.png",
        "title": "CoinView",
        "subtitle": "Mercado de criptomonedas a tiempo real",
        "url": "https://coinview-albeerc.vercel.app",
        "description": "Mercado de criptomonedas a tiempo real desarrollado con React JS para el front y la API de CoinGecko para traer toda la información de cada moneda. El sitio cuenta con una tabla de 100 criptomonedas con información básica, y cada una de ellas tiene un detalle donde se podrán ver más características específicas, como el precio en monedas de varios países"
    },
    {
        "id": 6,
        "img": "/images/journeylondon.png",
        "imgmobile": "/images/journeylondonmobile.png",
        "title": "JourneyLondon",
        "subtitle": "Sitio web de gimnasio",
        "url": "https://journey-london.vercel.app/",
        "description": "Sitio web completo para un gimnasio que ofrece una vista detallada de sus servicios y planes de suscripción. Utilizando HTML, CSS y JavaScript, el sitio proporciona una experiencia de usuario fluida y moderna."
    }
]